Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Note that `TokenStateManager` will encrypt the tokens before storing them in the session cookie. For example, here is how you configure it to split the tokens and encrypt them:
ja_jp: `TokenStateManager` はトークンをセッション・クッキーに保存する前に暗号化することに注意してください。例えば、トークンを分割して暗号化するように設定する方法を以下に示します：

source: Note that `io.quarkus.oidc.TokenIntrospection` (a simple `javax.json.JsonObject` wrapper) object will be created and can be either injected or accessed as a SecurityIdentity `introspection` attribute if either JWT or opaque token has been successfully introspected.
ja_jp: `io.quarkus.oidc.TokenIntrospection` (シンプルな `javax.json.JsonObject` ラッパー) オブジェクトが作成され、JWT または不透明トークンどちらかのイントロスペクションが成功した場合に SecurityIdentity `introspection` 属性として注入またはアクセスできることに注意してください。

source: Note that `openshift-client` extension has a dependency on the `kubernetes-client` extension.
ja_jp: `openshift-client` エクステンションは `kubernetes-client` エクステンションに依存していることに注意してください。

source: Note that `org.acme.rest.client.ExtensionsService` _must_ match the fully qualified name of the `ExtensionsService` interface we created in the previous section.
ja_jp: `org.acme.rest.client.ExtensionsService` は、前のセクションで作成した`ExtensionsService` インターフェイスの完全修飾名と _一致しなければならない_ ことに注意してください。

source: Note that `org.acme.rest.client.multipart.MultipartService` _must_ match the fully qualified name of the `MultipartService` interface we created in the previous section.
ja_jp: なお、 `org.acme.rest.client.multipart.MultipartService` は、前のセクションで作成した `MultipartService` インターフェースの完全修飾名と一致していなければならないことに注意してください。

source: Note that `quarkus update` can update your applications from any version of Quarkus (including 2.x) to Quarkus 3.20.
ja_jp: `quarkus update` は、Quarkus の任意のバージョン (2.x を含む) から Quarkus 3.20 へアプリケーションを更新できることに注意してください。

source: Note that `quarkus update` can update your applications from any version of Quarkus (including 2.x) to Quarkus 3.27.
ja_jp: `quarkus update` は、Quarkus の任意のバージョン (2.x を含む) から Quarkus 3.27 にアプリケーションを更新できます。

source: Note that `quarkus update` can update your applications from any version of Quarkus (including 2.x) to Quarkus 3.30.
ja_jp: `quarkus update` は、Quarkus の任意のバージョン (2.x を含む) から Quarkus 3.30 にアプリケーションを更新できることに注意してください。

source: Note that `quarkus update` can update your applications from any version of Quarkus (including 2.x) to Quarkus 3.31.
ja_jp: `quarkus update` は、Quarkusの任意のバージョン（2.xを含む）からQuarkus 3.31にアプリケーションを更新できることに注意してください。

source: Note that `quarkus update` can update your applications from any version of Quarkus (including 2.x) to Quarkus 3.32.
ja_jp: なお、`quarkus update` は、Quarkus の任意のバージョン (2.x を含む) から Quarkus 3.32 へアプリケーションを更新できます。

source: Note that `quarkus update` can update your applications from any version of Quarkus (including 2.x) to Quarkus 3.33 LTS.
ja_jp: `quarkus update` コマンドは、Quarkusの任意のバージョン（2.xを含む）からQuarkus 3.33 LTSにアプリケーションを更新できることに注意してください。

source: Note that `quarkus update` can update your applications from any version of Quarkus (including 2.x) to Quarkus 3.34.
ja_jp: なお、`quarkus update` は、Quarkus の任意のバージョン (2.x を含む) から Quarkus 3.34 にアプリケーションを更新できます。

source: Note that `quarkus update` should handle most of the heavy lifting for you, but there are still cases that should be handled manually and we recommend reading these migration guides carefully.
ja_jp: `quarkus update` コマンドはほとんどの面倒な作業を処理するはずですが、手動で処理する必要があるケースもまだありますので、これらの移行ガイドを注意深く読むことをお勧めします。

source: Note that `quarkus.datasource.username` is the original `agroal` property, whereas the `password` property is not included because the value will come from the `mydatabase` credentials provider we just defined. An alternative is to define both username and password in Vault and drop the `quarkus.datasource.username` property from configuration. All consuming extensions do support the ability to fetch both the username and password from the provider, or just the password.
ja_jp: `quarkus.datasource.username` はオリジナルの `agroal` プロパティですが、値は先ほど定義した `mydatabase`クレデンシャルプロバイダーから取得されるため、 `password` プロパティは含まれていません。 別の方法としては、Vault でユーザー名とパスワードの両方を定義し、設定から プロパティーを削除する方法があります。すべてのコンシューマーエクステンションは、ユーザー名とパスワードの両方をプロバイダから取得する機能、またはパスワードのみを取得する機能をサポートしています。

source: Note that a Panache entity may not be used from a blocking thread. See also xref:getting-started-reactive.adoc[Getting Started With Reactive] guide that explains the basics of reactive principles in Quarkus.
ja_jp: Panache エンティティーはブロッキングスレッドから使用できないことに注意してください。Quarkus のリアクティブ原則の基礎を説明する xref:getting-started-reactive.adoc[リアクティブ入門] ガイドも参照してください。

source: Note that a `@BuildStep` method will only be called if it produces something that another consumer or the final output requires. If there is no consumer for a particular item then it will not be produced. What is required will depend on the final target that is being produced. For example, when running in developer mode the final output will not ask for GraalVM-specific build items such as `ReflectiveClassBuildItem`, so methods that only produce these items will not be invoked.
ja_jp: `@BuildStep` メソッドは、別のコンシューマーまたは最終出力が必要とするものを生成する場合にのみ呼び出されることに注意してください。特定のアイテムのコンシューマーがいない場合は生成されません。必要なものは、最終的な生成物により異なります。たとえば開発者モードで実行している場合、最終出力では `ReflectiveClassBuildItem` などの GraalVM 固有のビルドアイテムが要求されないため、これらのアイテムのみを生成するメソッドは呼び出されません。

source: Note that a choice of using the opaque versus JWT token format is often driven by the architectural considerations. Opaque tokens are usually much shorter than JWT tokens but they require maintaining most of the token associated state in the provider database - the opaque tokens are effectively the database pointers. JWT tokens are significantly longer than the opaque tokens - but the providers are effectively delegating storing most of the token associated state to the client by storing it as the token claims and either signing and/or encrypting them.
ja_jp: 不透明なトークンとJWTトークンのどちらを使用するかは、多くの場合、アーキテクチャ上の考慮事項によって決定されることに注意してください。不透明なトークンは、通常、JWT トークンよりもはるかに短いですが、トークンに関連する状態のほとんどをプロバイダのデータベースで維持する必要があります。JWT トークンは、不透明なトークンよりもかなり長いですが、プロバイダは、トークンに関連する状態のほとんどを、トークン・クレームとして保存し、それらに署名や暗号を施すことで、事実上、クライアントに保存を委ねています。

source: Note that a cookie name varies when using xref:security-openid-connect-multitenancy.adoc[OpenID Connect Multi-Tenancy]. For example, it will be named `q_post_logout_tenant_1` for a tenant with a `tenant_1` ID, and so on.
ja_jp: xref:security-openid-connect-multitenancy.adoc[OpenID Connect Multi-Tenancy] を使用する場合、クッキー名が異なることに注意してください。 たとえば、 `tenant_1` ID を持つテナントの場合は `q_post_logout_tenant_1` という名前になります。

source: Note that a cookie name will vary when using xref:security-openid-connect-multitenancy.adoc[OpenID Connect Multi-Tenancy]. For example, it will be named `q_post_logout_tenant_1` for a tenant with a `tenant_1` id, etc.
ja_jp: xref:security-openid-connect-multitenancy.adoc[OpenID Connect マルチテナンシー] を使用する場合、クッキーの名前が異なることに注意してください。例えば、 `tenant_1` という ID のテナントに対しては `q_post_logout_tenant_1` という名前になるなどです。

source: Note that a fragment identifier must be unique in a template.
ja_jp: フラグメント識別子は、テンプレート内で一意でなければならないことに注意してください。

source: Note that a message processing failure nacks the message, which is then handled by the `failure-strategy`. It's the responsibility of the `failure-strategy` to report the failure and influence the outcome of the checks. The `fail` failure strategy reports the failure, and so the check will report the fault.
ja_jp: メッセージ処理の失敗はメッセージを nack し、それは `failure-strategy` によって処理されることに注意してください。失敗を報告し、チェックの結果に影響を与えるのは `failure-strategy` の責任です。`fail` 失敗戦略は失敗を報告するため、チェックも失敗を報告します。

source: Note that a message processing failures *nacks* the message which is then handled by the failure-strategy. It is the responsibility of the failure-strategy to report the failure and influence the outcome of the liveness checks. The `fail` failure strategy reports the failure and so the liveness check will report the failure.
ja_jp: メッセージ処理が失敗すると、メッセージが *否定応答* されることに注意してください。その場合、メッセージは失敗ストラテジーによって処理されます。失敗ストラテジーは、失敗を報告し、liveness チェックの結果に影響を与えます。失敗ストラテジー `fail`は、失敗を報告するため、liveness チェックも失敗を報告します。

source: Note that a message processing failures nacks the message, which is then handled by the `failure-strategy`. It is the responsibility of the `failure-strategy` to report the failure and influence the outcome of the checks. The `fail` failure strategy reports the failure, and so the check will report the fault.
ja_jp: メッセージ処理の失敗はメッセージをnackし、 `failure-strategy` で処理されることに注意してください。失敗を報告し、チェックの結果に影響を与えるのは `failure-strategy` です。失敗戦略の `fail` は失敗を報告し、チェックも失敗を報告します。

source: Note that a message processing failures nacks the message, which is then handled by the `failure-strategy`. It the responsibility of the `failure-strategy` to report the failure and influence the outcome of the checks. The `fail` failure strategy reports the failure, and so the check will report the fault.
ja_jp: メッセージ処理に失敗すると、そのメッセージは `failure-strategy` によって処理されます。 失敗を報告し、チェックの結果に影響を与えるのは `failure-strategy` の責任です。 `fail` 失敗ストラテジーは失敗を報告するので、チェックは失敗を報告します。

source: Note that a message processing failures nacks the message, which is then handled by the `failure-strategy`. It's the responsibility of the `failure-strategy` to report the failure and influence the outcome of the checks. The `fail` failure strategy reports the failure, and so the check will report the fault.
ja_jp: メッセージ処理の失敗はメッセージをnackし、 `failure-strategy` で処理されることに注意してください。失敗を報告し、チェックの結果に影響を与えるのは `failure-strategy` です。失敗戦略の `fail` は失敗を報告し、チェックも失敗を報告します。

source: Note that a test for the controller has been created as well:
ja_jp: コントローラーのテストも作成されていることに注意してください。

source: Note that all paths in the configuration may either specify a resource on the classpath (typically from `src/main/resources` or its subfolder) or an external file.
ja_jp: 設定のすべてのパスは、クラスパス上のリソース (通常は `src/main/resources` やそのサブフォルダーから) か外部ファイルを指定することに注意してください。

source: Note that all three models can be used in a single application.
ja_jp: この 3 つのモデルすべてを 1 つのアプリケーションで使用できます。

source: Note that although option (1) is the best choice performance wise, as it minimizes the applications footprint,it might not be trivial to implement. To make matters worse, it's also not easy to maintain as it is tightly coupled to the 3rd party library implementation. Option (2) is a straight forward alternative to work around the issue, but comes at the cost of including possibly never invoked code in the resulting native executable.
ja_jp: オプション(1)は、アプリケーションのフットプリントを最小化するため、パフォーマンス的には最良の選択ですが、実装が容易でない場合があることに注意してください。さらに悪いことに、サードパーティライブラリの実装と密接に結合しているため、保守も容易ではありません。オプション(2)は、この問題を回避するための簡単な代替案ですが、結果として得られるネイティブ実行可能ファイルに、実行されたことのないコードが含まれる可能性があるという代償を伴います。

source: Note that at present this approach does not work with native image testing, as this would require the test alternatives to be baked into the native image.
ja_jp: 現時点では、このアプローチはネイティブイメージテストでは機能しないことに注意してください。これには、代替テストをネイティブイメージに焼き付ける必要があるためです。

source: Note that at present this approach does not work with native image testing, as this would required the test alternatives to be baked into the native image.
ja_jp: 現在のところ、このアプローチはネイティブイメージテストでは機能しないことに注意してください。テスト代替品がネイティブイメージに焼き込まれる必要がある為です。

source: Note that at this time, Mandrel and GraalVM cannot record JFR for Windows native executables.
ja_jp: 現時点では、Mandrel と GraalVM は Windows ネイティブ実行可能ファイルの JFR を記録できないことに注意してください。

source: Note that auto-generating the Java class from the JSON Schema definition is not possible. Therefore, you must define the Java class as follows so it can be used by the serialization process:
ja_jp: JSON スキーマ定義から Java クラスを自動生成することはできないことに注意してください。したがって、シリアライズプロセスで使用できるように、次のように Java クラスを定義する必要があります。

source: Note that automatic discovery of the topology is usually the preferred choice. Static configuration should only be used when necessary. One such case is _Amazon Elasticache for Redis (Cluster Mode Disabled)_, where:
ja_jp: 通常は、トポロジーの自動検出が優先されることに注意してください。 静的設定は必要な場合にのみ使用してください。 そのようなケースの 1 つが、_Amazon Elasticache for Redis (クラスターモードが無効)_ です。

source: Note that both `RestClientWithOidcClientFilter` and `RestClientWithTokenPropagationFilter` interfaces are identical - the reason behind it is that combining `OidcClientRequestReactiveFilter` and `AccessTokenRequestReactiveFilter` on the same REST Client will cause side effects as both filters can interfere with other, for example, `OidcClientRequestReactiveFilter` may override the token propagated by `AccessTokenRequestReactiveFilter` or `AccessTokenRequestReactiveFilter` can fail if it is called when no token is available to propagate and `OidcClientRequestReactiveFilter` is expected to acquire a new token instead.
ja_jp: `RestClientWithOidcClientFilter` と `RestClientWithTokenPropagationFilter` の両方のインターフェースが同一であることに注意してください。その理由は、同じ REST Client で `OidcClientRequestReactiveFilter` と `AccessTokenRequestReactiveFilter` を組み合わせると、両方のフィルターが互いに干渉し合って副作用が発生するからです、 例えば、 `OidcClientRequestReactiveFilter` は `AccessTokenRequestReactiveFilter` によって伝播されたトークンを上書きするかもしれませんし、 `AccessTokenRequestReactiveFilter` は伝播できるトークンがないときに呼ばれると失敗するかもしれませんが、代わりに `OidcClientRequestReactiveFilter` には新しいトークンを取得することが期待されます。

source: Note that both configurations map to the same Keycloak server instance while using distinct `realms`.
ja_jp: どちらの設定でも、異なる `realms` を使用しばら、同じ Keycloak サーバーインスタンスにマップされることに注意してください。

source: Note that by default Reactive Messaging message processing happens sequentially, preserving the order of messages. In the same way, `@Blocking(ordered = false)` annotation changes this behaviour, using `@RunOnVirtualThread` enforces concurrent message processing without preserving the order.
ja_jp: デフォルトでは、Reactive Messaging のメッセージ処理はメッセージの順序を維持しながら順番に実行されることに注意してください。 同様に、 `@Blocking(ordered = false)`アノテーションはこの動作を変更します。 `@RunOnVirtualThread` を使用すると、順序を保持せずにメッセージの同時処理が強制されます。

source: Note that by default, `Dev Services for Keycloak` will not start a new container if it finds a container with a `quarkus-dev-service-keycloak` label and connect to it if this label's value matches the value of the `quarkus.keycloak.devservices.service-name` property (default value is `quarkus`). In such cases you will see a slightly different output when running:
ja_jp: デフォルトでは、 `Dev Services for Keycloak` は `quarkus-dev-service-keycloak` ラベルの付いたコンテナーを見つけると新しいコンテナーを起動せず、このラベルの値が `quarkus.keycloak.devservices.service-name` プロパティーの値 (デフォルト値は `quarkus`) と一致する場合はこれに接続することに注意してください。その場合、以下の実行中はわずかに異なる出力が表示されます。

source: Note that by default, `Dev Services for Keycloak` will not start a new container if it finds a container with a `quarkus-dev-service-keycloak` label and connect to it if this label's value matches the value of the `quarkus.keycloak.devservices.service-name` property (default value is `quarkus`). In such cases you will see a slighty different output when running:
ja_jp: デフォルトでは、 `Dev Services for Keycloak` は `quarkus-dev-service-keycloak` ラベルの付いたコンテナーを見つけると新しいコンテナーを起動せず、このラベルの値が `quarkus.keycloak.devservices.service-name` プロパティーの値 (デフォルト値は `quarkus`) と一致する場合はこれに接続することに注意してください。その場合、以下の実行中はわずかに異なる出力が表示されます:

source: Note that channels using the client configuration identified with `pulsar-auth` need to set the `client-configuration` attribute.
ja_jp: `pulsar-auth` で識別されるクライアント設定を使用するチャネルには、 `client-configuration` 属性を設定する必要があることに注意してください。

source: Note that continuous testing supports multi-module projects, so tests in modules other than the application can still be run when files are changed. The modules that are run can be controlled using config as listed below.
ja_jp: 継続的テストは、マルチモジュールのプロジェクトをサポートしているので、ファイルが変更された場合、アプリケーション以外のモジュールのテストが実行されることがあります。実行されるモジュールは、以下のように設定で制御できます。

source: Note that contrary to the High Level REST client, we are using the latest version of the Low Level REST client (which is still Open Source), and, while we believe it should work, the situation is less than ideal and might cause some issues. Feel free to override the versions of the clients in your applications depending on your requirements, but be aware of https://www.elastic.co/blog/elastic-license-v2[the new licence of the High Level REST Client] for versions 7.11+: it is not Open Source and has several usage restrictions.
ja_jp: 高レベルRESTクライアントとは逆に、低レベルRESTクライアントの最新バージョン（まだオープンソース）を使用しており、動作すると信じていますが、状況は理想的とは言えず、いくつかの問題が発生する可能性があることに注意してください。アプリケーションの要件に応じてクライアントのバージョンを自由に上書きできますが、バージョン7.11+の link:https://www.elastic.co/blog/elastic-license-v2[高レベルRESTクライアントの新しいライセンス] には注意してください：オープンソースではなく、いくつかの使用制限があります。

source: Note that convenience redirects for non-application endpoints are still present, but they can be disabled by setting `quarkus.http.redirect-to-non-application-root-path` to `false`. That hasn't changed at all.
ja_jp: アプリケーション以外のエンドポイントのための便利なリダイレクトはまだ存在しますが、 `quarkus.http.redirect-to-non-application-root-path` を `false` に設定することで無効にすることができます。これは全く変わっていません。

source: Note that currently, the `issue-certificate` command implicitly creates a Let's Encrypt account to make it easy for users to get started with the ACME protocol. Support for the Let's Encrypt account management will evolve further.
ja_jp: 現時点では、ユーザーが ACME プロトコルを簡単に開始できるように、 `issue-certificate` コマンドにより暗黙的に Let's Encrypt アカウントが作成されることに注意してください。 Let's Encrypt アカウント管理のサポートはさらに今後さらに進化する予定です。

source: Note that defining the generic type via a class hierarchy similar to the following example will also work correctly:
ja_jp: 以下の例のようにクラス階層を介してジェネリック型を定義した場合も、正しく動作することに注目してください。

source: Note that due to consumer rebalances, Kafka consumers only guarantee at-least-once processing of single records, meaning that uncommitted records _can_ be processed again by consumers.
ja_jp: コンシューマーのリバランスにより、Kafka コンシューマーは、単一レコードの少なくとも 1 回の処理のみを保証します。つまり、コミットされていないレコードは、コンシューマーによって再度処理 _できます_ 。

source: Note that each `Uni#subscribeAsCompletionStage()` results in a new subscription. You might need to configure memoization of the `Uni` item or failure before it's used as template data, i.e. `myUni.memoize().indefinitely()`.
ja_jp: 各 `Uni#subscribeAsCompletionStage()` は新しいサブスクリプションになることに注目してください。 `Uni` の項目や障害がテンプレートデータとして使用される前に、メモ化を設定する必要があるかもしれません。つまり、 `myUni.memoize().indefinitely()` .

source: Note that each client can have a different script, even a list of scripts. In the case of a list, the data is imported in the list order (for example, first `actors.redis`, then `movies.redis` for the `my-redis` client).
ja_jp: 各クライアントは異なるスクリプトを持つことができ、スクリプトのリストを持つこともできることに注意してください。リストの場合、データはリストの順番でインポートされます（たとえば、最初に `actors.redis` 、次に `my-redis` クライアントのための `movies.redis` ）。

source: Note that even if you initialize Keycloak from a realm file, it is still needed to set `quarkus.keycloak.devservices.users` property if a `password` grant is used to acquire the tokens to test the OIDC `service` applications.
ja_jp: レルムファイルから Keycloak を初期化する場合でも、トークンを取得して OIDC `service` アプリケーションをテストするために `password` グラントが使用される場合は、 `quarkus.keycloak.devservices.users` プロパティーを設定する必要があることに注意してください。

source: Note that even numbers are added to the list, and odd numbers remove an element from the list.
ja_jp: なお、偶数はリストに追加され、奇数はリストから要素を削除します。

source: Note that for a "text/html" template the special chars are replaced with html entities by default.
ja_jp: "text/html" テンプレートでは、デフォルトで特殊な char が html エンティティーに置き換えられることに注意してください。

source: Note that for generic classes, the type variable names must also be identical. For example, for the following class:
ja_jp: ジェネリッククラスの場合、型変数名も同一である必要があることに注意してください。 たとえば、次のクラスの場合:

source: Note that for production use the `transactional.id` must be unique across all application instances.
ja_jp: 本番環境で使用する場合、 `transactional.id` はすべてのアプリケーションインスタンスで一意である必要があることに注意してください。

source: Note that for the `check` method the parameter types must match what is specified in `@PreAuthorize` and that the return type must be a `boolean`.
ja_jp: `check` メソッドの場合、パラメータータイプは `@PreAuthorize` で指定されたものと一致する必要があり、戻り型は `boolean` である必要があることに注意してください。

source: Note that for this code to work, you need the content of the RSA private key corresponding to the public key you have in the `TokenSecuredResource` application. Take the following PEM content and place it into `security-jwt-quickstart/src/test/resources/privateKey.pem`:
ja_jp: このコードが機能するには、 `TokenSecuredResource` アプリケーションにある公開鍵に対応する RSA 秘密鍵の内容が必要であることに注意してください。 次の PEM コンテンツを取得して、 `security-jwt-quickstart/src/test/resources/privateKey.pem` に配置します。

source: Note that global variables implicitly add <<typesafe_expressions, parameter declarations>> to all templates and so any expression that references a global variable is validated during build.
ja_jp: グローバル変数は暗黙のうちにすべてのテンプレートに <<typesafe_expressions, パラメーター宣言>> を追加するため、グローバル変数を参照する式はビルド時に検証されることに注意してください。

source: Note that global variables implicitly add <<typesafe_expressions,parameter declarations>> to all templates and so any expression that references a global variable is validated during build.
ja_jp: グローバル変数は暗黙のうちにすべてのテンプレートに <<typesafe_expressions,parameter declarations>> を追加するため、グローバル変数を参照する式はビルド時に検証されることに注意してください。

source: Note that if an interface method contains an argument annotated with `@QueryParam`, that argument will take priority over anything specified in any `@ClientQueryParam` annotation.
ja_jp: インターフェイスメソッドに `@QueryParam` のアノテーションが付いた引数がある場合、 その引数は `@ClientQueryParam` のアノテーションで指定されたものよりも優先されることに注意してください。

source: Note that if proactive authentication is in use accessing the `SecurityIdentity` is a blocking operation. This is because authentication may not have happened yet, and accessing it may require calls to external systems such as databases that may block. For blocking applications this is no problem, however if you are have disabled authentication in a reactive application this will fail (as you cannot do blocking operations on the IO thread). To work around this you need to `@Inject` an instance of `io.quarkus.security.identity.CurrentIdentityAssociation`, and call the `Uni<SecurityIdentity> getDeferredIdentity();` method. You can then subscribe to the resulting `Uni` and will be notified when authentication is complete and the identity is available.
ja_jp: プロアクティブ認証を使用している場合、 `SecurityIdentity` へのアクセスはブロック操作になることに注意してください。これは、認証がまだ行われていない可能性があるためで、アクセスする際にデータベースなどの外部システムへの呼び出しが必要となり、ブロックされる可能性があるからです。ブロッキングアプリケーションの場合は問題ありませんが、リアクティブアプリケーションで認証を無効にしている場合は失敗します (IO スレッドでブロッキング操作を行うことができないため)。これを回避するには、 `io.quarkus.security.identity.CurrentIdentityAssociation` のインスタンスを `@Inject` し、 `Uni<SecurityIdentity> getDeferredIdentity();` メソッドを呼び出す必要があります。そして、結果として得られる `Uni` を購読し、認証が完了して ID が利用可能になったときに通知を受けることができます。

source: Note that if proactive authentication is in use accessing the `SecurityIdentity` is a blocking operation. This is because authentication may not have happened yet, and accessing it may require calls to external systems such as databases that may block. For blocking applications this is no problem, however if you have disabled authentication in a reactive application this will fail (as you cannot do blocking operations on the IO thread). To work around this you need to `@Inject` an instance of `io.quarkus.security.identity.CurrentIdentityAssociation`, and call the `Uni<SecurityIdentity> getDeferredIdentity();` method. You can then subscribe to the resulting `Uni` and will be notified when authentication is complete and the identity is available.
ja_jp: プロアクティブ認証が使用されている場合、 `SecurityIdentity` へのアクセスはブロックされることに注意してください。これは、認証がまだ行われていない可能性があるためです。また、データベースなどの外部システムを呼び出す必要があるため、ブロックされる可能性があります。ブロッキングアプリケーションでは問題ありませんが、リアクティブアプリケーションで認証を無効にしている場合、これは失敗します(IOスレッドでブロッキング操作を行うことができないため)。これを回避するには、 `io.quarkus.security.identity.CurrentIdentityAssociation` のインスタンスを `@Inject` して、 `Uni<SecurityIdentity> getDeferredIdentity();` メソッドを呼び出す必要があります。そして、生成された `Uni` をサブスクライブすることで、認証が完了し、ID が利用可能になったときに通知されるようになります。
